Ober lab eQTL pipeline

* Expression Data

Let's take a look at the expression data first 

#+BEGIN_SRC R :session rexp
dir("/home/nwknoblauch/Dropbox/scratch/ptb_scratch/Fertility_Studies__2015/")
#+END_SRC

#+RESULTS:
| AllColumnNames_final53.csv       |
| EndoSigCovar_Final.xlsx          |
| Final_GeneExprDetected.7.txt     |
| Genotypes_all_clean_numbered.txt |
| Kagan_QC+_5-30-12                |
| Kagan_QC+_5-30-12.zip            |
| README.txt                       |
| SNPloc_all.txt                   |

#+BEGIN_SRC R :session rexp
  library(tidyverse)

  inputf <- "/home/nwknoblauch/Dropbox/scratch/ptb_scratch/Fertility_Studies__2015/Final_GeneExprDetected.7.txt"
  covarf <- "/home/nwknoblauch/Dropbox/scratch/ptb_scratch/Fertility_Studies__2015/AllColumnNames_final53.csv"
  famf <- "/home/nwknoblauch/Dropbox/scratch/ptb_scratch/Fertility_Studies__2015/Kagan_QC+_5-30-12/Kagan_QC+_5-30-12.fam"
  expd <- read.table(inputf)
  expm <- data.matrix(expd)

#+END_SRC

#+RESULTS:

** Questions

How many individuals? 

#+BEGIN_SRC R :session rexp
ncol(expd)
#+END_SRC

#+RESULTS:
: 55


How many genes? 

#+BEGIN_SRC R :session rexp
nrow(expd)
#+END_SRC

#+RESULTS:
: 10191

Is the data scaled?


#+BEGIN_SRC R :session rexp :results graphics
plot(1:19)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session rexp :file test_hist_m.png :results output graphics
hist(colMeans(expm))
#+END_SRC

#+RESULTS:


#+BEGIN_SRC R :session rexp :results output graphics :file test_hist_v.png
hist(apply(expm,2,var))
#+END_SRC

#+RESULTS:

What about PCs? 
1) Scaled SVD scree
#+BEGIN_SRC R :session rexp :results output graphics :file test_scree_s.png

sexpm <- scale(expm,scale=TRUE,center=TRUE)
svds <- svd(sexpm)
plot(svds$d)
  #+END_SRC

  #+RESULTS:
  


Ok looks like there is a _lot_ of variance explained by PC 1 

#+BEGIN_SRC R :session rexp :results output graphics  :file test_scree_s.png
usvds <- svd(expm)
plot(usvds$d)
#+END_SRC

#+BEGIN_SRC R :session rexp :results output graphics  :file test_scree_prc.png
res <- prcomp(expm, center = TRUE, scale = TRUE)
res_rot <- res$rotation
res_rot_df <- as_tibble(res_rot[,1:10],rownames="id")  %>% mutate(id=str_remove(id,"X"))
#+END_SRC

#+RESULTS:


